Tekla.Structures.Drawing.PreferredPlacingTypes
The PreferredPlacingTypes class contains all the available preferred placing types.
Please note that not all objects accept all types.
If you try to use the wrong type it will not be accepted (Insert, Modify will fail).

Tekla.Structures.Drawing.PreferredPlacingTypes.PointPlacingType
The object is placed at one point (the insertion point) without any additional placing options.
Returns: A new point placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.BaseLinePlacingType
The object is placed using the base line placing.
Returns: A new base line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.BaseLineWithArrowAtStartPointPlacingType
The object is placed using the base line placing.
The line is drawn and will have an arrow at the start point.
Returns: A new base line with arrow at start point placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.BaseLineWithArrowAtEndPointPlacingType
The object is placed using the base line placing.
The line is drawn and will have an arrow at the end point.
Returns: A new base line with arrow at end point placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.AlongLinePlacingType
The object is placed using the along line placing.
Returns: A new along line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.AlongLineOrWithLeaderLinePlacingType
The object is placed using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
Returns: A new along line or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.AlongLineOrWithLeaderLineAndParentObjectAlongPartPlacingType
The object is placed using the along line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line and rotated to be at the same angle as the connected part.
Returns: A new along line or with leader line and parent object along part placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.AlongPartCenteredPlacingType
The object is placed using the along line placing.
The line used will be the part's edge in the center of that line.
Returns: A new along part centered placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.InsidePartAlongPartPlacingType
The object is placed using the base line placing.
The base line used is in the middle of the part, aligned with the part.
Returns: A new inside part along part placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.InsidePartAlongPartOrWithLeaderLinePlacingType
The object is placed using the base line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
The base line used is in the middle of the part, aligned with the part.
Returns: A new inside part along part or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.InsidePartHorizontalPlacingType
The object is placed using the base line placing.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.
Returns: A new inside part horizontal placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.InsidePartHorizontalOrWithLeaderLinePlacingType
The object is placed using the base line placing as the first option.
If there is no room for the first option the fallback option will be used.
The fallback option is placing the object with a leader line.
The base line used is in the middle of the part, aligned with the part.
In addition the object will be rotated to be horizontal in the drawing.
Returns: A new inside part horizontal or with leader line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.LeaderLinePlacingType
The object is placed with a leader line.
Returns: A new leader line placing type instance.

Tekla.Structures.Drawing.PreferredPlacingTypes.LeaderLineAndParentObjectAlongPartPlacingType
The object is placed with a leader line and rotated to be at the same angle as the connected part.
Returns: A new leader line and parent object along part placing type instance.